alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21G18B.atdf
          </instance>
        </module>
        <module name="SystemControl" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
            <parameters>
              <param name="__VTOR_PRESENT" value="1"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt name="NonMaskableInt" index="-14" caption="Non Maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Cortex-M0+ Hard Fault Interrupt"/>
        <interrupt name="SVCall" index="-5" caption="Cortex-M0+ SV Call Interrupt"/>
        <interrupt name="PendSV" index="-2" caption="Cortex-M0+ Pend SV Interrupt"/>
        <interrupt name="SysTick" index="-1" caption="Cortex-M0+ System Tick Interrupt"/>
        <interrupt name="SYSTEM" index="0" module-instance="MCLK OSCCTRL OSC32KCTRL PAC PM SUPC"/>
        <interrupt name="WDT" index="1" module-instance="WDT"/>
        <interrupt name="RTC" index="2" module-instance="RTC"/>
        <interrupt name="EIC" index="3" module-instance="EIC"/>
        <interrupt name="NVMCTRL" index="4" module-instance="NVMCTRL"/>
        <interrupt name="DMAC" index="5" module-instance="DMAC"/>
        <interrupt name="USB" index="6" module-instance="USB"/>
        <interrupt name="EVSYS" index="7" module-instance="EVSYS"/>
        <interrupt name="SERCOM0" index="8" module-instance="SERCOM0"/>
        <interrupt name="SERCOM1" index="9" module-instance="SERCOM1"/>
        <interrupt name="SERCOM2" index="10" module-instance="SERCOM2"/>
        <interrupt name="SERCOM3" index="11" module-instance="SERCOM3"/>
        <interrupt name="SERCOM4" index="12" module-instance="SERCOM4"/>
        <interrupt name="SERCOM5" index="13" module-instance="SERCOM5"/>
        <interrupt name="TCC0" index="14" module-instance="TCC0"/>
        <interrupt name="TCC1" index="15" module-instance="TCC1"/>
        <interrupt name="TCC2" index="16" module-instance="TCC2"/>
        <interrupt name="TC0" index="17" module-instance="TC0"/>
        <interrupt name="TC1" index="18" module-instance="TC1"/>
        <interrupt name="TC4" index="21" module-instance="TC4"/>
        <interrupt name="ADC" index="22" module-instance="ADC"/>
        <interrupt name="AC" index="23" module-instance="AC"/>
        <interrupt name="DAC" index="24" module-instance="DAC"/>
        <interrupt name="PTC" index="25" module-instance="PTC"/>
        <interrupt name="AES" index="26" module-instance="AES"/>
        <interrupt name="TRNG" index="27" module-instance="TRNG"/>
      </interrupts>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x10810214"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2245" version="1.0.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B">
          <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
          <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1"/>
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2"/>
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x10"/>
          <bitfield name="COMPEI0" caption="Comparator 0 Event Input Enable" mask="0x100"/>
          <bitfield name="COMPEI1" caption="Comparator 1 Event Input Enable" mask="0x200"/>
          <bitfield name="INVEI0" caption="Comparator 0 Input Event Invert Enable" mask="0x1000"/>
          <bitfield name="INVEI1" caption="Comparator 1 Input Event Invert Enable" mask="0x2000"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="COMP0" caption="Comparator 0" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0" mask="0x10"/>
        </register>
        <register name="STATUSA" offset="0x7" rw="R" size="1" initval="0x00" caption="Status A">
          <bitfield name="STATE0" caption="Comparator 0 Current State" mask="0x1"/>
          <bitfield name="STATE1" caption="Comparator 1 Current State" mask="0x2"/>
          <bitfield name="WSTATE0" caption="Window 0 Current State" mask="0x30" values="AC_STATUSA__WSTATE0"/>
        </register>
        <register name="STATUSB" offset="0x8" rw="R" size="1" initval="0x00" caption="Status B">
          <bitfield name="READY0" caption="Comparator 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="Comparator 1 Ready" mask="0x2"/>
        </register>
